Revit 2024 API
MEPAnalyticalNode.Location Property
 The location of this node.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public XYZ Location { get; }
Visual Basic
Public ReadOnly Property Location As XYZ
	Get
Visual C++
public:
property XYZ^ Location {
	XYZ^ get ();
}
See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace